export const getQuestions = ()=> {
    const questions = {
        question1: {
          title: "Как проверить скорость набора текста онлайн?",
          paragraphes: [
            "Скорость печати можно проверить на нашем сайте, для этого нужно просто пройти тест.",
            "Во время прохождении теста необходимо быть внимательным.",
            "При опечатке подсчет символов останавливается, но таймер продолжит отсчёти нужно как можно скорее ввести корректный символ.",
          ],
        },
        question2: {
          title: "Как измеряется скорость и точность печати?",
          paragraphes: [
            "Cкорость печати измеряется в знаках (без опечаток) в минуту. Знаком считается любой символ, включая пробелы. Учитываются только правильно набранные символы.",
            "Точность печати — это процент правильно введенных символов к общему количеству символов в тексте.",
          ],
        },
        question3: {
          title: "Какая скорость считается хорошей?",
          paragraphes: [
            "На этот вопрос нет однозначного ответа. Но если посмотреть на среднюю скорость печати на клавиатуре, которая составляет 207 зн./мин, то можно сказать, что хорошая скорость печати — это выше средней.",
            "Например, для офисных работников хорошей считается скорость 225 зн./мин и выше. Для секретарей — более 300 зн./мин.",
            "Для детей нормы скорости печати отличаются:",
          ],
          list: [
            "начальная школа — 40-75 зн./мин;",
            "средняя — 75-125 зн./мин;",
            "старшая — 100-175 зн./мин;",
            "студенты — более 150 зн./мин.",
          ],
        },
        question4: {
          title: "Какая средняя скорость слепой печати?",
          paragraphes: [
            "Средняя скорость печати составляет всего 207 знаков в минуту. Чтобы улучшить навыки набора текста и научиться печатать, как профессионал, нужно постоянно тренироваться.",
            "Запомни: практика, практика и еще раз практика. Исследования показали, что постоянная практика помогает превысить средний показатель скорости печати в три раза. Проверить скорость печати онлайн ты можешь вместе с нами.",
          ],
        },
        question5: {
          title: "Какая самая большая скорость печати?",
          paragraphes: [
            "1080 знаков за одну минуту на электрической пишущей машинке IBM — рекорд по скорости набора текста, установленный Стеллой Паджунас в 1946 году. Сейчас чемпионкой по набору текста на клавиатуре на английском языке является Барбара Блэкборн. Во время теста в 2005 году она развила скорость печати до 1060 знаков в минуту на клавиатуре Дворака — упрощенном варианте привычной нам раскладки QWERTY.",
            "Шон Врона установил очередной рекорд на чемпионате Ultimate Typing Championship — 1280 знаков в минуту. Врона также неофициально побил рекорд Блэкборн по скорости набора текста, поддерживая скорость 870 знаков в минуту в течение 50 минут. Хотя этот рекорд не признан Гиннессом, потому что команда его не отслеживала.",
          ],
        },
        question6: {
          title: "Скорость печати 100 зн./мин хорошая?",
          paragraphes: [
            "Зависит от возраста. Например, для детей начальной и средней школы это хорошая скорость. Для старшей школы и взрослых скорость 100 зн./мин считается низкой.",
            "Пройди курс печати и твоя скорость набора увеличится.",
          ],
        },
        question7: {
          title: "Как научиться печатать быстрее 500 зн./мин?",
          paragraphes: [
            "Рекордсмены печатают со скоростью 1000 зн./мин и выше, исходя из этого, 500 зн./мин — вполне достижимая цель.",
            "Залог успеха любого занятия — регулярная тренировка. Как только ты пропускаешь урок — ты теряешь время, которое уже потратил на обучение. Поэтому постарайся выделить 2-4 недели для регулярных тренировок — каждый день по 30 минут.",
          ],
        },
        question8: {
          title: "Может ли тестирование помочь улучшить скорость печати?",
          paragraphes: [
            "Рекордсмены печатают со скоростью 1000 зн./мин и выше, исходя из этого, 500 зн./мин — вполне достижимая цель.",
            "Залог успеха любого занятия — регулярная тренировка. Как только ты пропускаешь урок — ты теряешь время, которое уже потратил на обучение. Поэтому постарайся выделить 2-4 недели для регулярных тренировок — каждый день по 30 минут.",
          ],
        },
      };

    return questions;
}